{
  "experience": {
    "title": "Key Competencies",
    "items": [
      {
        "title": "Teamwork",
        "description": "Experience in effective collaboration and communication within multidisciplinary teams.",
        "details": [
          "Flexibility in working with professionals from different backgrounds",
          "Ability to listen and communicate ideas clearly",
          "Conflict resolution skills",
          "Supporting colleagues and creating a positive atmosphere",
          "Participating in joint problem-solving"
        ]
      },
      {
        "title": "Responsibility",
        "description": "Completing tasks on time with attention to detail.",
        "details": [
          "Independent time management",
          "Meeting deadlines",
          "High level of self-organization",
          "Taking responsibility for results",
          "Accuracy and attention to detail"
        ]
      },
      {
        "title": "Adaptability",
        "description": "Quickly learning new technologies and work methods.",
        "details": [
          "Willingness to adapt to changes",
          "Mastering new tools and approaches",
          "Quick response to new tasks",
          "Flexible thinking",
          "Ability to work in conditions of uncertainty"
        ]
      },
      {
        "title": "Creativity",
        "description": "Generating new solutions for non-standard tasks.",
        "details": [
          "Developing original ideas",
          "Applying unconventional approaches",
          "Visualizing and presenting new concepts",
          "Critical thinking",
          "Inspiring colleagues to seek new solutions"
        ]
      }
    ]
  },
  "keyResponsibilities": {
    "title": "KEY RESPONSIBILITIES",
    "items": [
      "Organized team development based on a predefined design system using Git and Agile/Scrum methodologies.",
      "Developed a scalable application architecture and implemented efficient state management with Redux Toolkit and RTK Query.",
      "Optimized asynchronous data handling (Redux-thunk, Axios, REST/GraphQL API), integrated and tested APIs using Postman and Swagger.",
      "Built user-friendly and secure forms with validation (React Hook Form, Formik, Zod).",
      "Configured modern routing (React Router, App Router), ensuring reliable navigation between pages.",
      "Implemented authentication with password recovery, account creation and editing, and secure login/logout functionality.",
      "Integrated real-time features via WebSocket (chat functionality).",
      "Created polymorphic and custom UI components using Radix UI, Material UI, Antd, Styled Components, and Tailwind CSS.",
      "Implemented internationalization (i18n) to support multiple languages.",
      "Used Storybook for visual testing and documentation of components.",
      "Applied TDD practices, writing unit and end-to-end tests (Jest, Cypress) to ensure code quality.",
      "Automated CI/CD processes with GitHub Actions, GitLab CI, and Jenkins.",
      "Participated in deployment and orchestration of applications via Docker, Kubernetes, and cloud services (Vercel, Netlify, AWS).",
      "Improved code quality and stability through linting and auto-formatting (ESLint, Prettier).",
      "Enhanced performance and security by optimizing resource loading and implementing best practices (SSR/SSG, code splitting, a11y)."
    ]
  },
  "education": {
    "title": "Education",
    "items": [
      {
        "course": "Frontend Developer",
        "organization": "IT-INCUBATOR",
        "period": "2024"
      },
      {
        "course": "JavaScript Developer",
        "organization": "WebCademy",
        "period": "2023"
      },
      {
        "course": "Frontend Developer",
        "organization": "itProger",
        "period": "2022"
      },
      {
        "course": "Engineer",
        "organization": "Belarusian National Technical University",
        "period": "2015"
      }
    ]
  },
  "languages": {
    "title": "Languages",
    "items": [
      {
        "language": "Russian",
        "level": "Native"
      },
      {
        "language": "English",
        "level": "B1 (Intermediate)"
      },
      {
        "language": "Polish",
        "level": "C1 (Advanced)"
      }
    ]
  }
}