{
  "title": "Портфолио",
  "viewProject": "Смотреть проект",
  "viewAllProjects": "Посмотреть все мои проекты",
  "projects": [
    {
      "title": "MovieSearch",
      "description": "MovieSearch - это современное веб-приложение для поиска фильмов и сериалов.\nПриложение позволяет легко находить интересные фильмы и сериалы, использовать фильтры, сохранять любимые фильмы в \"Избранное\" и просматривать историю своих поисковых запросов.",
      "link": "https://github.com/AliakseiKrasko/movie-search-app",
      "image": "/1.png"
    },
    {
      "title": "GitHub User Explorer",
      "description": "GitHub User Explorer — это приложение для поиска пользователей GitHub с подробной статистикой по аккаунту. Реализован поиск по имени пользователя, визуализация данных (репозитории, языки, фолловеры), а также история поиска.",
      "link": "https://github.com/AliakseiKrasko/github-user-explorer",
      "image": "/2.png"
    },
    {
      "title": "TaskFlow",
      "description": "TaskFlow - это современное веб-приложение для управления задачами (TodoList), реализованное на стеке React, Redux Toolkit и RTK Query. Проект поддерживает полноценную аутентификацию и авторизацию пользователей, что позволяет защищать персональные данные и управлять доступом к задачам.",
      "link": "https://github.com/AliakseiKrasko/ToDoList_React",
      "image": "/3.png"
    },
    {
      "title": "Социальная сеть коммерческого назначения (Проект в разработке)",
      "description": "Социальная сеть коммерческого назначения (Проект в разработке) — это многофункциональная платформа, созданная для эффективного взаимодействия бизнеса и клиентов, а также для продвижения товаров и услуг в цифровом пространстве. На данный момент проект находится в активной фазе разработки. Участвую во всех этапах: от проектирования архитектуры и пользовательских сценариев до реализации фронтенда и взаимодействия с бэкендом. Работаю над созданием продукта, способного вывести коммуникацию и продвижение бизнеса на новый уровень.",
      "link": "https://github.com/ictroot70/Ict/tree/auth",
      "image": "/8.png"
    }
  ]
}